Tekla Open API Reference for Tekla Structures 2025
Polycurve Constructor (PolyLine)
 Initializes a new instance of the Polycurve class from a PolyLine. The lines are converted to line segments.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polycurve(
	PolyLine polyLine
)
Public Sub New (
	polyLine As PolyLine
)
Parameters
polyLine
Type: Tekla.Structures.Geometry3d.PolyLine
Initial geometry for the geometry list
See Also
Reference
Polycurve Class
Polycurve Overload
Tekla.Structures.Geometry3d Namespace